export const StartMessage = `Привет 👋
Ты в боте с юридической базой для дизайнеров и креативных специалистов.

Здесь ты можешь получить готовые договоры, сценарии передачи прав, NDA и документы по персональным данным — всё, чтобы ты мог работать с клиентами легально, защищать свои работы и выстраивать сотрудничество профессионально.

Выбирай нужный пакет ниже 👇`;

export const ClientsPackMessage = `Здесь ты можешь приобрести юридический пак для работы с клиентами, который защитит тебя, твои проекты и твой доход.

Что дает пак:
▫️Защищает авторство
▫️Даёт законные основания получать оплату
▫️Легально передаёт/не передаёт исключительные права
▫️Устраняет споры с клиентами
▫️Помогает выставлять правильные условия
▫️Позволяет заключать разный формат работы одним документом (абонентский договор, лицензионный, с полной или частичной передачей прав)

Внутри пакета:
✔ Универсальный договор-конструктор
✔ Аддоны к договору под частные случаи
✔ Шаблон дополнительного соглашения к договору
✔ Приложение к договору
✔ Шаблон соглашения о передаче исключительных прав
✔ Аддоны по передаче прав
✔ Акт приёма-передачи
✔ Договор NDA
✔ Абонентский формат
✔ Видеоинструкция по работе с документами

Цена: 16 999 ₽`;

export const LegalDataMessage = `Этот пакет для тех, кто хочет легально вести деятельность в рамках законодательства РФ.

Если ты работаешь с клиентами, заключаешь договоры и получаешь персональные данные (ФИО, телефон, почта и т.д.), ты автоматически становишься оператором персональных данных и обязан иметь соответствующие документы, даже если у тебя нет сайта.

Пакет даёт готовую юридическую базу, которая помогает избежать штрафов и претензий.

Внутри пакета:
✔ Политика конфиденциальности
✔ Обработка ПД
✔ Хранение и уничтожение
✔ Видео-разбор регистрации оператора ПД

Цена: 8 990 ₽`;

export const FullLegalPackMessage = `Этот пакет для тех, кто хочет полностью закрыть юридическую сторону своей работы:
договоры, права, конфиденциальность и персональные данные.

Ты получаешь готовую систему документов, с которой можно легально работать с клиентами, защищать свои работы и выстраивать сотрудничество профессионально — без страха штрафов и юридических рисков.

В пакете ты получишь:

🧾 Договоры для работы с клиентами
✔ Универсальный договор-конструктор
✔ Аддоны с вариантами передачи прав и лицензий
✔ NDA (доп. соглашение о конфиденциальности)
✔ Абонентский формат договора
✔ Акт приёма-передачи услуг
✔ Приложение «Состав услуг»
✔ Видео-инструкция по работе с договором

🔐 Персональные данные и закон
✔ Политика конфиденциальности
✔ Политика обработки персональных данных
✔ Порядок хранения и уничтожения персональных данных
✔ Видео-разбор регистрации оператора ПД

Этот комплект закрывает ключевые юридические вопросы дизайнера и креативного специалиста.

<s>Цена: 27 990 ₽</s>
Цена: 25 990 ₽`;

export const WhyBetterMessage = `Основная проблема творческих специалситов - большинство договоров, которыми пользуются дизайнеры и креаторы, не защищают ни автора, ни его работы.

Проблема бесплатных шаблонов из интернета: 
❌ Не учитывают передачу авторских прав
❌ Не предусматривают лицензионные настройки
❌ Не защищают дизайнерские работы
❌ Часто являются копиями устаревших и юридически невалидных документов

Что есть в моем паке:
✅ Договор, разработанный совместно с практикующим юристом
✅ Универсальный и гибкий конструктор
✅ Закрытие сразу нескольких взаимодействий с клиентами:
▫️абонентский договор (долгосрочное сотрудничество)
▫️разовый проект с аддонами (однократное сотрудничество с разными условиями под частные случаи)
▫️аддон с полной передачей исключительных прав (соглашение)
▫️аддон с частичной передачей прав (соглашение)
▫️лицензионные соглашения под конкретную работу
▫️договор NDA

Пак закрывает все юридические аспекты и стоит намного дешевле, чем разработка документов с нуля с юристом (экономия до 70%)`;

export const ChoosePaymentServiceMessage = 'Выберите удобный способ оплаты:';

export const FAQMessage = `Какой формат у документов?
ᐳ Google-документы, полностью редактируемые.

Подходит ли для начинающего дизайнера?
ᐳ Да — инструкции адаптированы.

Нужен ли сайт для политики конфиденциальности?
ᐳ Нет. Заполняя договор и работая с чужими ФИО → ты оператор ПД по российскому законодательству. 

Как получить пак после оплаты?
ᐳ Сразу в боте, автоматически.

Пак остается со мной навсегда?
ᐳ Да, купив один раз, все материалы останутся с вами навсегда 

Подходит для самозанятых или для ИП?
ᐳ Пак разработан для самозанятых и индивидуальных предпринимателей. Между договорами ИП и самозанятого есть юридические различия — и в паке есть отдельный видеоурок, где я подробно объясняю, какие пункты нужно изменить и как правильно адаптировать документ под свой статус и формат работы. После этого вы сможете без проблем настроить договор под себя и свою деятельность.`;

export const FailureCommandMessage = 'Упс! Что-то не так. Давай вернемся и попробуем еще раз.';
export const UnknownCommandMessage = 'Я не знаю такой команды. Давай вернемся в меню и попробуем еще раз.';

const OfferContractLink = 'https://docs.google.com/document/d/1abJk8D8vrRGUPIIssFm3Pjk9e9yqToCFD4449OIuQSQ/edit?usp=sharing';
export const OfferContractMessage = `<a href="${OfferContractLink}">договор оферты</a>`

export const PaymentMsg_RU = `Оплата для клиентов из России — через ЮKassa.
Принимаются карты любого банка РФ, СБП. Нажимая кнопку "Оплатить" вы принимаете ${OfferContractMessage}.`;

export const PaymentMsg_EU = `Оплата для клиентов, находящихся за пределами РФ — через Payoneer. Вы можете оплатить картой ЕС/США/других стран, 
в любой валюте. Нажимая кнопку "Оплатить" вы принимаете ${OfferContractMessage}.`;

export const UserDocumentsMessages = {
    mainContract: `Бот автоматически отправляет видео-инструкцию по <a href="https://docs.google.com/document/d/1abJk8D8vrRGUPIIssFm3Pjk9e9yqToCFD4449OIuQSQ/edit?usp=sharing">основному договору</a> для дизайнеров`,
    personalData: `Бот автоматически отправляет видео-инструкцию по <a href="https://docs.google.com/document/d/1abJk8D8vrRGUPIIssFm3Pjk9e9yqToCFD4449OIuQSQ/edit?usp=sharing">обработке персональных данных</a>`,
    companyStyleData: `<a href="https://docs.google.com/document/d/1abJk8D8vrRGUPIIssFm3Pjk9e9yqToCFD4449OIuQSQ/edit?usp=sharing">Сообщение про фирменный стиль и бриф</a>`,
    webData: `<a href="https://docs.google.com/document/d/1abJk8D8vrRGUPIIssFm3Pjk9e9yqToCFD4449OIuQSQ/edit?usp=sharing">Сообщение про бриф по вебу</a>`,
    calculationsData: `<a href="https://docs.google.com/document/d/1abJk8D8vrRGUPIIssFm3Pjk9e9yqToCFD4449OIuQSQ/edit?usp=sharing">Сообщение про рассчет стоимости</a>`,
    endData: `Спасибо! Пак успешно доставлен.
Если у вас есть вопросы — нажмите кнопку "Связаться со мной"
Сохраните это сообщение, чтобы не потерять файлы`
};
